gazooyr/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["content", "ooops something went wrong"], ["created_at", "2017-07-06 12:55:11.102020"], ["updated_at", "2017-07-06 12:55:11.102020"]]
---
  def create
    @post  = Post.new(post_params)
    redirect_to root_path, flash: { notice: "New post successfully created !" } if @post.save